// This is an independent project of an individual developer. Dear PVS-Studio, please check it.
// PVS-Studio Static Code Analyzer for C, C++ and C#: http://www.viva64.com
#include "Menu.h"
#include "Options.hpp"
#include "XorStr.hpp"
#include "Hooks.hpp"
#include "float_functions.h"
#include "ImGUI/imgui_internal.h"
#include "Utils.hpp"
#include "CustomWinAPI.h"
#include <filesystem>
//#define _PREMIUM_VERSION

std::vector<const char*>  teams = {
	"Terrorists",
	"Counter-Terrorists"
};

std::vector<const char*> sky_names = {
    "default",
    "cs_baggage_skybox_",
    "cs_tibet",
    "embassy",
    "italy",
    "jungle",
    "nukeblank",
    "office",
    "sky_cs15_daylight01_hdr",
    "sky_cs15_daylight02_hdr",
    "sky_cs15_daylight03_hdr",
    "sky_cs15_daylight04_hdr",
    "sky_csgo_cloudy01",
    "sky_csgo_night02",
    "sky_csgo_night02b",
    "sky_dust",
    "sky_venice",
    "vertigo",
    "vertigoblue_hdr",
    "vietnam",
	"sky_descent"
};

struct _rarity_colors
{
	ImVec4 _default;
	ImVec4 _common;
	ImVec4 _uncommon;
	ImVec4 _rare;
	ImVec4 _mythical;
	ImVec4 _legendary;
	ImVec4 _ancient;
	ImVec4 _immortal;
	constexpr _rarity_colors() noexcept
	{
		_default = ImColor(106, 97, 86).operator ImVec4();
		_common = ImColor(176, 195, 217).operator ImVec4();
		_uncommon = ImColor(94, 152, 217).operator ImVec4();
		_rare = ImColor(75, 105, 255).operator ImVec4();
		_mythical = ImColor(136, 71, 255).operator ImVec4();
		_legendary = ImColor(211, 44, 230).operator ImVec4();
		_ancient = ImColor(235, 75, 75).operator ImVec4();
		_immortal = ImColor(228, 174, 57).operator ImVec4();
	}
};
constexpr _rarity_colors rarity_colors;

const ImVec4& GetRarityColor(int rarity) noexcept
{
	switch (rarity)
	{
	case SourceEngine::ITEM_RARITY_DEFAULT:
		return rarity_colors._default;
	case 	SourceEngine::ITEM_RARITY_COMMON:
		return rarity_colors._common;
	case 	SourceEngine::ITEM_RARITY_UNCOMMON:
		return rarity_colors._uncommon;
	case 	SourceEngine::ITEM_RARITY_RARE:
		return rarity_colors._rare;
	case 	SourceEngine::ITEM_RARITY_MYTHICAL:
		return rarity_colors._mythical;
	case 	SourceEngine::ITEM_RARITY_LEGENDARY:
		return rarity_colors._legendary;
	case 	SourceEngine::ITEM_RARITY_ANCIENT:
		return rarity_colors._ancient;
	case 	SourceEngine::ITEM_RARITY_IMMORTAL:
		return rarity_colors._immortal;
	default:
		return rarity_colors._default;
	}
}

using LoadNamedSky_t = void(__fastcall*)(const char*);
LoadNamedSky_t load_named_sky = nullptr;
char currentloadedsky[128] = "";
void ChangeSky(const unsigned id)
{
    if (!load_named_sky)
    {
        load_named_sky = reinterpret_cast<LoadNamedSky_t>(Utils::FindSignature(
            SourceEngine::memory.engine(), XorStr("55 8B EC 81 EC ? ? ? ? 56 57 8B F9 C7 45")));
        if (!load_named_sky)
            return; //ERROR, signature outdated
    }
	if ( id > sky_names.size())
	{
		const auto default_sky = static_cast<SourceEngine::ConVar*>(Hooks::g_allCvars->at(FNV("sv_skyname")))->GetString();
		if (default_sky)
		{
			if (strcmp(default_sky, currentloadedsky) == 0)
				return;
			load_named_sky(default_sky);
		}
	}
	else
	{
		if (strcmp(sky_names.at(id), currentloadedsky) == 0)
			return;
		if (id == 0)
		{
			const auto default_sky = static_cast<SourceEngine::ConVar*>(Hooks::g_allCvars->at(FNV("sv_skyname")))->GetString();
			if (default_sky)
			{
				load_named_sky(default_sky);
				strcpy_s(currentloadedsky, 128, default_sky);
			}
			return;
		}
		static_cast<SourceEngine::ConVar*>(Hooks::g_allCvars->at(FNV("r_3dsky")))->SetFlags(FCVAR_NONE);
		static_cast<SourceEngine::ConVar*>(Hooks::g_allCvars->at(FNV("r_3dsky")))->SetValue(0);
		load_named_sky(sky_names.at(id));
		strcpy_s(currentloadedsky, 128, sky_names.at(id));
	}
}


char skin_id_buffer[40];

void DrawSkinEditor()
{
    Options::menu.skin_editor_window = true;
    ImGui::Begin("SkinEditor", &Options::menu.skin_editor_window, ImVec2(500, 400), 0.9f,
                 ImGuiWindowFlags_NoCollapse | ImGuiWindowFlags_NoSavedSettings);

    ImGui::InputText("PaintKitID", skin_id_buffer, 40);

    if (strlen(skin_id_buffer))
    {
        SourceEngine::CCStrike15ItemSchema* item_schema = SourceEngine::interfaces.ItemSchema();
        SourceEngine::CPaintKit* paint_kit = item_schema->GetPaintKitDefinitionByName(skin_id_buffer);
        if (paint_kit)
        {
            ImGui::InputInt("Rarity", &paint_kit->rarity);

            ImGui::ColorEdit4("1", paint_kit->color[0]);
            ImGui::ColorEdit4("2", paint_kit->color[1]);
            ImGui::ColorEdit4("3", paint_kit->color[2]);
            ImGui::ColorEdit4("4", paint_kit->color[3]);

            ImGui::InputFloat("scale", &paint_kit->pattern_scale);
            ImGui::InputFloat("offset_x_start", &paint_kit->pattern_offset_x_start);
            ImGui::InputFloat("offset_x_end", &paint_kit->pattern_offset_x_end);
            ImGui::InputFloat("offset_y_start", &paint_kit->pattern_offset_y_start);
            ImGui::InputFloat("offset_y_end", &paint_kit->pattern_offset_y_end);
            ImGui::InputFloat("rotate_start", &paint_kit->pattern_rotate_start);
            ImGui::InputFloat("rotate_end", &paint_kit->pattern_rotate_end);
        }
    }

    /*
    __int32 PaintKitID; //0x0000
    ::CUtlString name; //0x0004
    ::CUtlString description_string; //0x0014
    ::CUtlString description_tag; //0x0024
    ::CUtlString pattern; //0x0034
    ::CUtlString normal; //0x0044
    ::CUtlString logo_material; //0x0044
    __int32 unk1; //0x0054
    __int32 rarity; //0x0058
    __int32 style; //0x005C
    __int8 color[4][4]; //0x0060
    __int8 logocolor[4][4]; //0x0070
    float wear_default; //0x0080
    float wear_remap_min; //0x0084
    float wear_remap_max; //0x0088
    __int8 seed; //0x008C
    __int8 phongexponent; //0x008D
    __int8 phongalbedoboost; //0x008E
    __int8 phongintensity; //0x008F
    float pattern_scale; //0x0090
    float pattern_offset_x_start; //0x0094
    float pattern_offset_x_end; //0x0098
    float pattern_offset_y_start; //0x009C
    float pattern_offset_y_end; //0x00A0
    float pattern_rotate_start; //0x00A4
    float pattern_rotate_end; //0x00A8
    float logo_scale; //0x00AC
    float logo_offset_x; //0x00B0
    float logo_offset_y; //0x00B4
    float logo_rotation; //0x00B8
    __int8 ignore_weapon_size_scale; //0x00BC
    //bool pad3;
    //bool pad4;
    //bool pad5;
    __int32 view_model_exponent_override_size; //0x00C0
    bool only_first_material; //0x00C4
    bool use_normal;
    ::CUtlString vmt_path; //0x00C8
    KeyValues* vmt_overrides; //0x00D8
    *
    */

    ImGui::End();
}

void DrawCSGOLeaks()
{
    ImGui::Begin(XorStr("CS:GO Leaks"), &Options::leaks.main_window, ImVec2(500, 400), 1.0f,
                 ImGuiWindowFlags_NoCollapse | ImGuiWindowFlags_NoSavedSettings);
    sprintf(Options::leaks.profile_link, "https://stat.cschanger.com/profile/%llu", SourceEngine::interfaces.Engine()->GetSteamAPIContext()->m_pSteamUser->GetSteamID().m_unAll64Bits);
    ImGui::InputText(XorStr("Link to profile"), Options::leaks.profile_link, 260, ImGuiInputTextFlags_ReadOnly);
    if (ImGui::Button(XorStr("Open")))
    {
        ShellExecuteA(nullptr, "open", Options::leaks.profile_link, nullptr, nullptr, SW_SHOWNORMAL);
    }
    ImGui::End();
}

void sendClanTag(const char* name, const char* tag)
{
	auto kv = new SourceEngine::KeyValues("ClanTagChanged");
    kv->SetString("name", name);
    kv->SetString("tag", tag);
    SourceEngine::interfaces.Engine()->ServerCmdKeyValues(kv);
